knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>P1RI7CR2</name>
          <displayName>P1RI7CR2</displayName>
          <description>DCMIPP Pipe1 ROI7 configuration register 2</description>
          <addressOffset>0x958</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1RI8CR1</name>
          <displayName>P1RI8CR1</displayName>
          <description>DCMIPP Pipe1 ROI8 configuration register 1</description>
          <addressOffset>0x95C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1RI8CR2</name>
          <displayName>P1RI8CR2</displayName>
          <description>DCMIPP Pipe1 ROI8 configuration register 2</description>
          <addressOffset>0x960</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1GMCR</name>
          <displayName>P1GMCR</displayName>
          <description>DCMIPP Pipex gamma configuration register</description>
          <addressOffset>0x970</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVCR</name>
          <displayName>P1YUVCR</displayName>
          <description>DCMIPP Pipe1 YUVConv configuration register</description>
          <addressOffset>0x980</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>Output samples type used while CLAMP is activated</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLAMP</name>
              <description>Clamp the output samples</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVRR1</name>
          <displayName>P1YUVRR1</displayName>
          <description>DCMIPP Pipe1 YUVConv red coefficient register 1</description>
          <addressOffset>0x984</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RR</name>
              <description>Coefficient row 1 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RG</name>
              <description>Coefficient row 1 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVRR2</name>
          <displayName>P1YUVRR2</displayName>
          <description>DCMIPP Pipe1 YUVConv red coefficient register 2</description>
          <addressOffset>0x988</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RB</name>
              <description>Coefficient row 1 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RA</name>
              <description>Coefficient row 1 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVGR1</name>
          <displayName>P1YUVGR1</displayName>
          <description>DCMIPP Pipe1 YUVConv green coefficient register 1</description>
          <addressOffset>0x98C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GR</name>
              <description>Coefficient row 2 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GG</name>
              <description>Coefficient row 2 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVGR2</name>
          <displayName>P1YUVGR2</displayName>
          <description>DCMIPP Pipe1 YUVConv green coefficient register 2</description>
          <addressOffset>0x990</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GB</name>
              <description>Coefficient row 2 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Coefficient row 2 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVBR1</name>
          <displayName>P1YUVBR1</displayName>
          <description>DCMIPP Pipe1 YUVConv blue coefficient register 1</description>
          <addressOffset>0x994</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BR</name>
              <description>Coefficient row 3 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG</name>
              <description>Coefficient row 3 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1YUVBR2</name>
          <displayName>P1YUVBR2</displayName>
          <description>DCMIPP Pipe1 YUV blue coefficient register 2</description>
          <addressOffset>0x998</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB</name>
              <description>Coefficient row 3 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BA</name>
              <description>Coefficient row 3 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPCR</name>
          <displayName>P1PPCR</displayName>
          <description>DCMIPP Pipe1 pixel packer configuration register</description>
          <addressOffset>0x9C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Memory format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAPRB</name>
              <description>Swaps R-vs-B components if RGB, and U-vs-V components if YUV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LMAWM</name>
              <description>Line multi address wrapping modulo.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LMAWE</name>
              <description>Line multi address wrapping enable bit.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0AR1</name>
          <displayName>P1PPM0AR1</displayName>
          <description>DCMIPP Pipe1 pixel packer Memory0 address register 1</description>
          <addressOffset>0x9C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0AR2</name>
          <displayName>P1PPM0AR2</displayName>
          <description>DCMIPP Pipe1 pixel packer Memory0 address register 2</description>
          <addressOffset>0x9C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM0PR</name>
          <displayName>P1PPM0PR</displayName>
          <description>DCMIPP Pipex pixel packer Memory0 pitch register</description>
          <addressOffset>0x9CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM0AR</name>
          <displayName>P1STM0AR</displayName>
          <description>DCMIPP Pipex status Memory0 address register</description>
          <addressOffset>0x9D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM1AR1</name>
          <displayName>P1PPM1AR1</displayName>
          <description>DCMIPP Pipex pixel packer Memory1 address register 1</description>
          <addressOffset>0x9D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM1AR2</name>
          <displayName>P1PPM1AR2</displayName>
          <description>DCMIPP Pipex pixel packer Memory1 address register 2</description>
          <addressOffset>0x9D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM1PR</name>
          <displayName>P1PPM1PR</displayName>
          <description>DCMIPP Pipex pixel packer Memory1 pitch register</description>
          <addressOffset>0x9DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM1AR</name>
          <displayName>P1STM1AR</displayName>
          <description>DCMIPP Pipex status Memory1 address register</description>
          <addressOffset>0x9E0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM2AR1</name>
          <displayName>P1PPM2AR1</displayName>
          <description>DCMIPP Pipex pixel packer memory2 address register 1</description>
          <addressOffset>0x9E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory 2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1PPM2AR2</name>
          <displayName>P1PPM2AR2</displayName>
          <description>DCMIPP Pipex pixel packer memory2 address register 2</description>
          <addressOffset>0x9E8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory 2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1STM2AR</name>
          <displayName>P1STM2AR</displayName>
          <description>DCMIPP Pipex status Memory2 address register</description>
          <addressOffset>0x9F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1IER</name>
          <displayName>P1IER</displayName>
          <description>DCMIPP Pipe1 interrupt enable register</description>
          <addressOffset>0x9F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINEIE</name>
              <description>Multi-line capture completed interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAMEIE</name>
              <description>Frame capture completed interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNCIE</name>
              <description>VSYNC interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRIE</name>
              <description>Overrun interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
