knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>P2FSCR</name>
          <displayName>P2FSCR</displayName>
          <description>DCMIPP Pipe2 flow selection configuration register</description>
          <addressOffset>0xC04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTIDA</name>
              <description>Data type ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VC</name>
              <description>Flow selection mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDTF</name>
              <description>Force data type format</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDTFEN</name>
              <description>Force data type format enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIPEN</name>
              <description>Activation of PipeN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2FCTCR</name>
          <displayName>P2FCTCR</displayName>
          <description>DCMIPP Pipex flow control configuration register</description>
          <addressOffset>0xD00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CRSTR</name>
          <displayName>P2CRSTR</displayName>
          <description>DCMIPP Pipex crop window start register</description>
          <addressOffset>0xD04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CRSZR</name>
          <displayName>P2CRSZR</displayName>
          <description>DCMIPP Pipex crop window size register</description>
          <addressOffset>0xD08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide. If the value is maintained at 0 when enabling the crop by means of the ENABLE bit, the value is forced internally at 0xFFE, which is the maximum value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high. If the value is maintained at 0 when enabling the crop thanks to the ENABLE bit, the value is forced internally at 0xFFE, which is the maximum value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DCCR</name>
          <displayName>P2DCCR</displayName>
          <description>DCMIPP Pipex decimation register</description>
          <addressOffset>0xD0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDEC</name>
              <description>Horizontal decimation ratio</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDEC</name>
              <description>Vertical decimation ratio</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSCR</name>
          <displayName>P2DSCR</displayName>
          <description>DCMIPP Pipex downsize configuration register</description>
          <addressOffset>0xD10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HDIV</name>
              <description>Horizontal division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDIV</name>
              <description>Vertical division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSRTIOR</name>
          <displayName>P2DSRTIOR</displayName>
          <description>DCMIPP Pipex downsize ratio register</description>
          <addressOffset>0xD14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRATIO</name>
              <description>Horizontal ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VRATIO</name>
              <description>Vertical ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSSZR</name>
          <displayName>P2DSSZR</displayName>
          <description>DCMIPP Pipex downsize destination size register</description>
          <addressOffset>0xD18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CMRICR</name>
          <displayName>P2CMRICR</displayName>
          <description>DCMIPP Pipex common ROI configuration register</description>
          <addressOffset>0xD20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROILSZ</name>
              <description>Region of interest line size width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI1EN</name>
              <description>Region of interest 1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI2EN</name>
              <description>Region of interest 2 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI3EN</name>
              <description>Region of interest 3 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI4EN</name>
              <description>Region of interest 4 enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI5EN</name>
              <description>Region of interest 5 enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI6EN</name>
              <description>Region of interest 6 enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI7EN</name>
              <description>Region of interest 7 enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROI8EN</name>
              <description>Region of interest 8 enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI1CR1</name>
          <displayName>P2RI1CR1</displayName>
          <description>DCMIPP Pipe2 ROI1 configuration register 1</description>
          <addressOffset>0xD24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI1CR2</name>
          <displayName>P2RI1CR2</displayName>
          <description>DCMIPP Pipe2 ROI1 configuration register 2</description>
          <addressOffset>0xD28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI2CR1</name>
          <displayName>P2RI2CR1</displayName>
          <description>DCMIPP Pipe2 ROI2 configuration register 1</description>
          <addressOffset>0xD2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI2CR2</name>
          <displayName>P2RI2CR2</displayName>
          <description>DCMIPP Pipe2 ROI2 configuration register 2</description>
          <addressOffset>0xD30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI3CR1</name>
          <displayName>P2RI3CR1</displayName>
          <description>DCMIPP Pipe2 ROI3 configuration register 1</description>
          <addressOffset>0xD34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI3CR2</name>
          <displayName>P2RI3CR2</displayName>
          <description>DCMIPP Pipe2 ROI3 configuration register 2</description>
          <addressOffset>0xD38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI4CR1</name>
          <displayName>P2RI4CR1</displayName>
          <description>DCMIPP Pipe2 ROI4 configuration register 1</description>
          <addressOffset>0xD3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RI4CR2</name>
          <displayName>P2RI4CR2</displayName>
          <description>DCMIPP Pipe2 ROI4 configuration register 2</description>
          <addressOffset>0xD40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
