knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>RCFGLOCKR</name>
          <displayName>RCFGLOCKR</displayName>
          <description>GPIO port A resource configuration lock register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RLOCK0</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK1</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK2</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK3</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK4</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK5</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK6</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK7</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK8</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK9</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK10</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK11</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK12</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK13</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK14</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLOCK15</name>
              <description>I/O pin y of port x resource lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAYRL</name>
          <displayName>DELAYRL</displayName>
          <description>GPIO port A delay low register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY0</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY1</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY2</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY3</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY4</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY5</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY6</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY7</name>
              <description>Port x IO pin y delay setup</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAYRH</name>
          <displayName>DELAYRH</displayName>
          <description>GPIO port A delay high register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY8</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY9</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY10</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY11</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY12</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY13</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY14</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY15</name>
              <description>Port x I/O pin y delay setup</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOCFGRL</name>
          <displayName>PIOCFGRL</displayName>
          <description>GPIO port A PIO control low register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIOCFG0</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG1</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG2</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG3</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG4</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG5</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG6</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG7</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOCFGRH</name>
          <displayName>PIOCFGRH</displayName>
          <description>GPIO port A PIO control high register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIOCFG8</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG9</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG10</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG11</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG12</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG13</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG14</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIOCFG15</name>
              <description>Port x I/O pin y configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR10</name>
          <displayName>HWCFGR10</displayName>
          <description>GPIO port A hardware configuration register 10</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00011140</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHB_IOP</name>
              <description>Bus interface selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFSIZE_CFG</name>
              <description>Number of AF available for each I/O (accepted value: 1 to 4)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEED_CFG</name>
              <description>Number of speed lines for each I/O</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_CFG</name>
              <description>Lock mechanism activation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_CFG</name>
              <description>Security activation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OR_CFG</name>
              <description>Option register configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR9</name>
          <displayName>HWCFGR9</displayName>
          <description>GPIO port A hardware configuration register 9</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_IO</name>
              <description>Presence granularity, each bit indicate the I/O presence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR8</name>
          <displayName>HWCFGR8</displayName>
          <description>GPIO port A hardware configuration register 8</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <resetValue>0xC00CCCCC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_AF_IO8</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO9</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO10</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO11</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO12</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO13</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO14</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO15</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR7</name>
          <displayName>HWCFGR7</displayName>
          <description>GPIO port A hardware configuration register 7</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <resetValue>0xCCCEECCC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_AF_IO0</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO1</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO2</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO3</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO4</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO5</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO6</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO7</name>
              <description>Indicate which is the fastest AF for I/Oy (0 to F)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR6</name>
          <displayName>HWCFGR6</displayName>
          <description>GPIO port A hardware configuration register 6</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <resetValue>0xABFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODER_RES</name>
              <description>MODER register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
