knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>ISR2</name>
          <displayName>ISR2</displayName>
          <description>IAC interrupt status register 2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IAF64</name>
              <description>illegal access interrupt enable for peripheral 64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF65</name>
              <description>illegal access interrupt enable for peripheral 65</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF66</name>
              <description>illegal access interrupt enable for peripheral 66</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF67</name>
              <description>illegal access interrupt enable for peripheral 67</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF68</name>
              <description>illegal access interrupt enable for peripheral 68</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF69</name>
              <description>illegal access interrupt enable for peripheral 69</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF70</name>
              <description>illegal access interrupt enable for peripheral 70</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF71</name>
              <description>illegal access interrupt enable for peripheral 71</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF72</name>
              <description>illegal access interrupt enable for peripheral 72</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF73</name>
              <description>illegal access interrupt enable for peripheral 73</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF74</name>
              <description>illegal access interrupt enable for peripheral 74</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF75</name>
              <description>illegal access interrupt enable for peripheral 75</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF76</name>
              <description>illegal access interrupt enable for peripheral 76</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF77</name>
              <description>illegal access interrupt enable for peripheral 77</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF78</name>
              <description>illegal access interrupt enable for peripheral 78</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF79</name>
              <description>illegal access interrupt enable for peripheral 79</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF80</name>
              <description>illegal access interrupt enable for peripheral 80</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF81</name>
              <description>illegal access interrupt enable for peripheral 81</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF82</name>
              <description>illegal access interrupt enable for peripheral 82</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF83</name>
              <description>illegal access interrupt enable for peripheral 83</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF84</name>
              <description>illegal access interrupt enable for peripheral 84</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF85</name>
              <description>illegal access interrupt enable for peripheral 85</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF86</name>
              <description>illegal access interrupt enable for peripheral 86</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF87</name>
              <description>illegal access interrupt enable for peripheral 87</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF88</name>
              <description>illegal access interrupt enable for peripheral 88</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF89</name>
              <description>illegal access interrupt enable for peripheral 89</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF90</name>
              <description>illegal access interrupt enable for peripheral 90</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF91</name>
              <description>illegal access interrupt enable for peripheral 91</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF92</name>
              <description>illegal access interrupt enable for peripheral 92</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF93</name>
              <description>illegal access interrupt enable for peripheral 93</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF94</name>
              <description>illegal access interrupt enable for peripheral 94</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF95</name>
              <description>illegal access interrupt enable for peripheral 95</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR3</name>
          <displayName>ISR3</displayName>
          <description>IAC interrupt status register 3</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IAF96</name>
              <description>illegal access interrupt enable for peripheral 96</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF97</name>
              <description>illegal access interrupt enable for peripheral 97</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF98</name>
              <description>illegal access interrupt enable for peripheral 98</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF99</name>
              <description>illegal access interrupt enable for peripheral 99</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF100</name>
              <description>illegal access interrupt enable for peripheral 100</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF101</name>
              <description>illegal access interrupt enable for peripheral 101</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF102</name>
              <description>illegal access interrupt enable for peripheral 102</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF103</name>
              <description>illegal access interrupt enable for peripheral 103</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF104</name>
              <description>illegal access interrupt enable for peripheral 104</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF105</name>
              <description>illegal access interrupt enable for peripheral 105</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF106</name>
              <description>illegal access interrupt enable for peripheral 106</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF107</name>
              <description>illegal access interrupt enable for peripheral 107</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF108</name>
              <description>illegal access interrupt enable for peripheral 108</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF109</name>
              <description>illegal access interrupt enable for peripheral 109</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF110</name>
              <description>illegal access interrupt enable for peripheral 110</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF111</name>
              <description>illegal access interrupt enable for peripheral 111</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF112</name>
              <description>illegal access interrupt enable for peripheral 112</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF113</name>
              <description>illegal access interrupt enable for peripheral 113</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF114</name>
              <description>illegal access interrupt enable for peripheral 114</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF115</name>
              <description>illegal access interrupt enable for peripheral 115</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF116</name>
              <description>illegal access interrupt enable for peripheral 116</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF117</name>
              <description>illegal access interrupt enable for peripheral 117</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF118</name>
              <description>illegal access interrupt enable for peripheral 118</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF119</name>
              <description>illegal access interrupt enable for peripheral 119</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF120</name>
              <description>illegal access interrupt enable for peripheral 120</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF121</name>
              <description>illegal access interrupt enable for peripheral 121</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF122</name>
              <description>illegal access interrupt enable for peripheral 122</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF123</name>
              <description>illegal access interrupt enable for peripheral 123</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF124</name>
              <description>illegal access interrupt enable for peripheral 124</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF125</name>
              <description>illegal access interrupt enable for peripheral 125</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF126</name>
              <description>illegal access interrupt enable for peripheral 126</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAF127</name>
              <description>illegal access interrupt enable for peripheral 127</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
