knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>I3C status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XDCNT</name>
              <description>Data counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABT</name>
              <description>A private read message is ended prematurely by the target (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Message direction</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MID</name>
              <description>Message identifier/counter of a given frame (when the I3C acts as controller)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER</name>
          <displayName>SER</displayName>
          <description>I3C status error register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CODERR</name>
              <description>Protocol error code/type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Protocol error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL</name>
              <description>SCL stall error (when the I3C acts as target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVR</name>
              <description>RX-FIFO overrun or TX-FIFO underrun</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COVR</name>
              <description>C-FIFO underrun or S-FIFO overrun (when the I3C acts as controller)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANACK</name>
              <description>Address not acknowledged (when the I3C is configured as controller)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DNACK</name>
              <description>Data not acknowledged (when the I3C acts as controller)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DERR</name>
              <description>Data error (when the I3C acts as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMR</name>
          <displayName>RMR</displayName>
          <description>I3C received message register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIRDCNT</name>
              <description>IBI received payload data count (when the I3C is configured as controller)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCODE</name>
              <description>Received CCC code (when the I3C is configured as target)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RADD</name>
              <description>Received target address (when the I3C is configured as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVR</name>
          <displayName>EVR</displayName>
          <description>I3C event register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEF</name>
              <description>C-FIFO empty flag (whatever the I3C acts as controller)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFEF</name>
              <description>TX-FIFO empty flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFNFF</name>
              <description>C-FIFO not full flag (when the I3C acts as controller)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFNEF</name>
              <description>S-FIFO not empty flag (when the I3C acts as controller)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFNFF</name>
              <description>TX-FIFO not full flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFNEF</name>
              <description>RX-FIFO not empty flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXLASTF</name>
              <description>Last written data byte/word flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXLASTF</name>
              <description>Last read data byte/word flag (when the I3C acts as controller)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCF</name>
              <description>Frame complete flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTGTENDF</name>
              <description>Target-initiated read end flag (when the I3C acts as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRF</name>
              <description>Flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIF</name>
              <description>IBI flag (when the I3C acts as controller)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIENDF</name>
              <description>IBI end flag (when the I3C acts as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRF</name>
              <description>Controller-role request flag (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRUPDF</name>
              <description>Controller-role update flag (when the I3C acts as target)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJF</name>
              <description>Hot-join flag (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKPF</name>
              <description>Wake-up/missed start flag (when the I3C acts as target)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GETF</name>
              <description>Get flag (when the I3C acts as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAF</name>
              <description>Get status flag (when the I3C acts as target)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAUPDF</name>
              <description>Dynamic address update flag (when the I3C acts as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MWLUPDF</name>
              <description>Maximum write length update flag (when the I3C acts as target)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRLUPDF</name>
              <description>Maximum read length update flag (when the I3C acts as target)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTF</name>
              <description>Reset pattern flag (when the I3C acts as target)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASUPDF</name>
              <description>Activity state update flag (when the I3C acts as target)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTUPDF</name>
              <description>Interrupt/controller-role/hot-join update flag (when the I3C acts as target)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEFF</name>
              <description>DEFTGTS flag (when the I3C acts as target)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GRPF</name>
              <description>Group addressing flag (when the I3C acts as target)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>I3C interrupt enable register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFNFIE</name>
              <description>C-FIFO not full interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFNEIE</name>
              <description>S-FIFO not empty interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFNFIE</name>
              <description>TX-FIFO not full interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFNEIE</name>
              <description>RX-FIFO not empty interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCIE</name>
              <description>frame complete interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTGTENDIE</name>
              <description>target-initiated read end interrupt enable (when the I3C acts as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>error interrupt enable (whatever the I3C acts as controller/target)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIIE</name>
              <description>IBI request interrupt enable (when the I3C acts as controller)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIENDIE</name>
              <description>IBI end interrupt enable (when the I3C acts as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRIE</name>
              <description>Controller-role request interrupt enable (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRUPDIE</name>
              <description>Controller-role update interrupt enable (when the I3C acts as target)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJIE</name>
              <description>Hot-join interrupt enable (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKPIE</name>
              <description>Wake-up interrupt enable (when the I3C acts as target)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GETIE</name>
              <description>GETxxx CCC interrupt enable (except GETSTATUS of format 1) (when the I3C acts as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAIE</name>
              <description>format 1 GETSTATUS CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAUPDIE</name>
              <description>ENTDAA/RSTDAA/SETNEWDA CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MWLUPDIE</name>
              <description>SETMWL CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRLUPDIE</name>
              <description>SETMRL CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTIE</name>
              <description>reset pattern interrupt enable (when the I3C acts as target)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASUPDIE</name>
              <description>ENTASx CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTUPDIE</name>
              <description>ENEC/DISEC CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEFIE</name>
              <description>DEFTGTS CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GRPIE</name>
              <description>DEFGRPA CCC interrupt enable (when the I3C acts as target)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
