knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>CEVR</name>
          <displayName>CEVR</displayName>
          <description>I3C clear event register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFCF</name>
              <description>Clear frame complete flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRXTGTENDF</name>
              <description>Clear target-initiated read end flag (when the I3C acts as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CERRF</name>
              <description>Clear error flag (whatever the I3C acts as controller/target)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIBIF</name>
              <description>Clear IBI request flag (when the I3C acts as controller)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIBIENDF</name>
              <description>Clear IBI end flag (when the I3C acts as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCRF</name>
              <description>Clear controller-role request flag (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCRUPDF</name>
              <description>Clear controller-role update flag (when the I3C acts as target)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHJF</name>
              <description>Clear hot-join flag (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWKPF</name>
              <description>Clear wake-up flag (when the I3C acts as target)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CGETF</name>
              <description>Clear GETxxx CCC flag (except GETSTATUS of format 1) (when the I3C acts as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSTAF</name>
              <description>Clear format 1 GETSTATUS CCC flag (when the I3C acts as target)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDAUPDF</name>
              <description>Clear ENTDAA/RSTDAA/SETNEWDA CCC flag (when the I3C acts as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMWLUPDF</name>
              <description>Clear SETMWL CCC flag (when the I3C acts as target)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMRLUPDF</name>
              <description>Clear SETMRL CCC flag (when the I3C acts as target)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRSTF</name>
              <description>Clear reset pattern flag (when the I3C acts as target)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CASUPDF</name>
              <description>Clear ENTASx CCC flag (when the I3C acts as target)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CINTUPDF</name>
              <description>Clear ENEC/DISEC CCC flag (when the I3C acts as target)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDEFF</name>
              <description>Clear DEFTGTS CCC flag (when the I3C acts as target)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CGRPF</name>
              <description>Clear DEFGRPA CCC flag (when the I3C acts as target)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR0</name>
          <displayName>DEVR0</displayName>
          <description>I3C own device characteristics register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAVAL</name>
              <description>Dynamic address is valid (when the I3C acts as target)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DA</name>
              <description>7-bit dynamic address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIEN</name>
              <description>IBI request enable (when the I3C acts as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREN</name>
              <description>Controller-role request enable (when the I3C acts as target)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HJEN</name>
              <description>Hot-join request enable (when the I3C acts as target)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Activity state (when the I3C acts as target)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTACT</name>
              <description>Reset action/level on received reset pattern (when the I3C acts as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTVAL</name>
              <description>Reset action is valid (when the I3C acts as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR1</name>
          <displayName>DEVR1</displayName>
          <description>I3C device 1 characteristics register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>Assigned I3C dynamic address to target x (when the I3C acts as controller)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIACK</name>
              <description>IBI request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRACK</name>
              <description>Controller-role request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDEN</name>
              <description>IBI data enable (when the I3C acts as controller)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend/stop I3C transfer on received IBI (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>DA[6:0] write disabled (when the I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR2</name>
          <displayName>DEVR2</displayName>
          <description>I3C device 2 characteristics register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>Assigned I3C dynamic address to target x (when the I3C acts as controller)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIACK</name>
              <description>IBI request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRACK</name>
              <description>Controller-role request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDEN</name>
              <description>IBI data enable (when the I3C acts as controller)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend/stop I3C transfer on received IBI (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>DA[6:0] write disabled (when the I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR3</name>
          <displayName>DEVR3</displayName>
          <description>I3C device 3 characteristics register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>Assigned I3C dynamic address to target x (when the I3C acts as controller)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIACK</name>
              <description>IBI request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRACK</name>
              <description>Controller-role request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDEN</name>
              <description>IBI data enable (when the I3C acts as controller)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend/stop I3C transfer on received IBI (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>DA[6:0] write disabled (when the I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR4</name>
          <displayName>DEVR4</displayName>
          <description>I3C device 4 characteristics register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>Assigned I3C dynamic address to target x (when the I3C acts as controller)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIACK</name>
              <description>IBI request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRACK</name>
              <description>Controller-role request acknowledge (when the I3C acts as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDEN</name>
              <description>IBI data enable (when the I3C acts as controller)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend/stop I3C transfer on received IBI (when the I3C acts as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>DA[6:0] write disabled (when the I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXRLR</name>
          <displayName>MAXRLR</displayName>
          <description>I3C maximum read length register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRL</name>
              <description>Maximum data read length (when I3C acts as target)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIP</name>
              <description>IBI payload data maximum size, in bytes (when I3C acts as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXWLR</name>
          <displayName>MAXWLR</displayName>
          <description>I3C maximum write length register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MWL</name>
              <description>Maximum data write length (when I3C acts as target)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR0</name>
          <displayName>TIMINGR0</displayName>
          <description>I3C timing register 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCLL_PP</name>
              <description>SCL low duration in I3C push-pull phases, in number of kernel clocks cycles:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLH_I3C</name>
              <description>SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of kernel clocks cycles:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLL_OD</name>
              <description>SCL low duration in open-drain phases, used for legacy I less than sup&gt;2 less than /sup&gt;C messages and for I3C open-drain phases (address phase following a start, ACK phase during controller-initiated messages, and T bit phase during direct/private/IBI payload), in number of kernel clocks cycles:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLH_I2C</name>
              <description>SCL high duration, used for legacy I less than sup&gt;2 less than /sup&gt;C messages, in number of kernel clocks cycles:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR1</name>
          <displayName>TIMINGR1</displayName>
          <description>I3C timing register 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVAL</name>
              <description>Number of kernel clock cycles to set a time unit of 1  s, whatever I3C acts as controller or target.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASNCR</name>
              <description>Activity state of the new controller (when I3C acts as active controller)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREE</name>
              <description>Number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time (when the I3C acts as controller)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA_HD</name>
              <description>SDA hold time (when the I3C acts as controller), in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull t less than sub&gt;HD_PP less than /sub&gt;):</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
