knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>LOCKCFGR2</name>
          <displayName>LOCKCFGR2</displayName>
          <description>RCC divider lock configuration register2</description>
          <addressOffset>0x7A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1LOCK</name>
              <description>Defines the lock protection of the IC1 divider configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC2LOCK</name>
              <description>Defines the lock protection of the IC2 divider configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC3LOCK</name>
              <description>Defines the lock protection of the IC3 divider configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC4LOCK</name>
              <description>Defines the lock protection of the IC4 divider configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC5LOCK</name>
              <description>Defines the lock protection of the IC5 divider configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC6LOCK</name>
              <description>Defines the lock protection of the IC6 divider configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC7LOCK</name>
              <description>Defines the lock protection of the IC7 divider configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC8LOCK</name>
              <description>Defines the lock protection of the IC8 divider configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC9LOCK</name>
              <description>Defines the lock protection of the IC9 divider configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC10LOCK</name>
              <description>Defines the lock protection of the IC10 divider configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC11LOCK</name>
              <description>Defines the lock protection of the IC11 divider configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC12LOCK</name>
              <description>Defines the lock protection of the IC12 divider configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC13LOCK</name>
              <description>Defines the lock protection of the IC13 divider configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC14LOCK</name>
              <description>Defines the lock protection of the IC14 divider configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC15LOCK</name>
              <description>Defines the lock protection of the IC15 divider configuration bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC16LOCK</name>
              <description>Defines the lock protection of the IC16 divider configuration bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC17LOCK</name>
              <description>Defines the lock protection of the IC17 divider configuration bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC18LOCK</name>
              <description>Defines the lock protection of the IC18 divider configuration bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC19LOCK</name>
              <description>Defines the lock protection of the IC19 divider configuration bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC20LOCK</name>
              <description>Defines the lock protection of the IC20 divider configuration bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR2</name>
          <displayName>PUBCFGR2</displayName>
          <description>RCC divider public configuration register2</description>
          <addressOffset>0x7AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PUB</name>
              <description>Defines the public protection of the IC1 divider configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2PUB</name>
              <description>Defines the public protection of the IC2 divider configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3PUB</name>
              <description>Defines the public protection of the IC3 divider configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4PUB</name>
              <description>Defines the public protection of the IC4 divider configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5PUB</name>
              <description>Defines the public protection of the IC5 divider configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC6PUB</name>
              <description>Defines the public protection of the IC6 divider configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC7PUB</name>
              <description>Defines the public protection of the IC7 divider configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC8PUB</name>
              <description>Defines the public protection of the IC8 divider configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC9PUB</name>
              <description>Defines the public protection of the IC9 divider configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC10PUB</name>
              <description>Defines the public protection of the IC10 divider configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC11PUB</name>
              <description>Defines the public protection of the IC11 divider configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC12PUB</name>
              <description>Defines the public protection of the IC12 divider configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC13PUB</name>
              <description>Defines the public protection of the IC13 divider configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC14PUB</name>
              <description>Defines the public protection of the IC14 divider configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC15PUB</name>
              <description>Defines the public protection of the IC15 divider configuration bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC16PUB</name>
              <description>Defines the public protection of the IC16 divider configuration bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC17PUB</name>
              <description>Defines the public protection of the IC17 divider configuration bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC18PUB</name>
              <description>Defines the public protection of the IC18 divider configuration bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC19PUB</name>
              <description>Defines the public protection of the IC19 divider configuration bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IC20PUB</name>
              <description>Defines the public protection of the IC20 divider configuration bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR3</name>
          <displayName>SECCFGR3</displayName>
          <description>RCC system secure configuration register3</description>
          <addressOffset>0x7B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODSEC</name>
              <description>Defines the secure protection of the MOD system configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSSEC</name>
              <description>Defines the secure protection of the SYS system configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSSEC</name>
              <description>Defines the secure protection of the BUS system configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSEC</name>
              <description>Defines the secure protection of the PER system configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSEC</name>
              <description>Defines the secure protection of the INT system configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTSEC</name>
              <description>Defines the secure protection of the RST system configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFTSEC</name>
              <description>Defines the secure protection of the DFT system configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR3</name>
          <displayName>PRIVCFGR3</displayName>
          <description>RCC system privilege configuration register3</description>
          <addressOffset>0x7B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPV</name>
              <description>Defines the privilege protection of the MOD system configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSPV</name>
              <description>Defines the privilege protection of the SYS system configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSPV</name>
              <description>Defines the privilege protection of the BUS system configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERPV</name>
              <description>Defines the privilege protection of the PER system configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPV</name>
              <description>Defines the privilege protection of the INT system configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPV</name>
              <description>Defines the privilege protection of the RST system configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFTPV</name>
              <description>Defines the privilege protection of the DFT system configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR3</name>
          <displayName>LOCKCFGR3</displayName>
          <description>RCC system lock configuration register3</description>
          <addressOffset>0x7B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODLOCK</name>
              <description>Defines the lock protection of the MOD system configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSLOCK</name>
              <description>Defines the lock protection of the SYS system configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSLOCK</name>
              <description>Defines the lock protection of the BUS system configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERLOCK</name>
              <description>Defines the lock protection of the PER system configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTLOCK</name>
              <description>Defines the lock protection of the INT system configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTLOCK</name>
              <description>Defines the lock protection of the RST system configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTLOCK</name>
              <description>Defines the lock protection of the DFT system configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR3</name>
          <displayName>PUBCFGR3</displayName>
          <description>RCC system public configuration register3</description>
          <addressOffset>0x7BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPUB</name>
              <description>Defines the public protection of the MOD system configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSPUB</name>
              <description>Defines the public protection of the SYS system configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSPUB</name>
              <description>Defines the public protection of the BUS system configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERPUB</name>
              <description>Defines the public protection of the PER system configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPUB</name>
              <description>Defines the public protection of the INT system configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPUB</name>
              <description>Defines the public protection of the RST system configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFTPUB</name>
              <description>Defines the public protection of the DFT system configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
