knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>SECCFGR4</name>
          <displayName>SECCFGR4</displayName>
          <description>RCC bus secure configuration register4</description>
          <addressOffset>0x7C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNSEC</name>
              <description>Defines the secure protection of the ACLKN bus configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKNCSEC</name>
              <description>Defines the secure protection of the ACLKNC bus configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBMSEC</name>
              <description>Defines the secure protection of the AHBM bus configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1SEC</name>
              <description>Defines the secure protection of the AHB1 bus configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2SEC</name>
              <description>Defines the secure protection of the AHB2 bus configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3SEC</name>
              <description>Defines the secure protection of the AHB3 bus configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB4SEC</name>
              <description>Defines the secure protection of the AHB4 bus configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB5SEC</name>
              <description>Defines the secure protection of the AHB5 bus configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB1SEC</name>
              <description>Defines the secure protection of the APB1 bus configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB2SEC</name>
              <description>Defines the secure protection of the APB2 bus configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB3SEC</name>
              <description>Defines the secure protection of the APB3 bus configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB4SEC</name>
              <description>Defines the secure protection of the APB4 bus configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB5SEC</name>
              <description>Defines the secure protection of the APB5 bus configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOCSEC</name>
              <description>Defines the secure protection of the NOC bus configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR4</name>
          <displayName>PRIVCFGR4</displayName>
          <description>RCC bus privilege configuration register4</description>
          <addressOffset>0x7C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPV</name>
              <description>Defines the privilege protection of the ACLKN bus configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKNCPV</name>
              <description>Defines the privilege protection of the ACLKNC bus configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBMPV</name>
              <description>Defines the privilege protection of the AHBM bus configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1PV</name>
              <description>Defines the privilege protection of the AHB1 bus configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2PV</name>
              <description>Defines the privilege protection of the AHB2 bus configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3PV</name>
              <description>Defines the privilege protection of the AHB3 bus configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB4PV</name>
              <description>Defines the privilege protection of the AHB4 bus configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB5PV</name>
              <description>Defines the privilege protection of the AHB5 bus configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB1PV</name>
              <description>Defines the privilege protection of the APB1 bus configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB2PV</name>
              <description>Defines the privilege protection of the APB2 bus configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB3PV</name>
              <description>Defines the privilege protection of the APB3 bus configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB4PV</name>
              <description>Defines the privilege protection of the APB4 bus configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB5PV</name>
              <description>Defines the privilege protection of the APB5 bus configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOCPV</name>
              <description>Defines the privilege protection of the NOC bus configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR4</name>
          <displayName>LOCKCFGR4</displayName>
          <description>RCC bus lock configuration register4</description>
          <addressOffset>0x7C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNLOCK</name>
              <description>Defines the lock protection of the ACLKN bus configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACLKNCLOCK</name>
              <description>Defines the lock protection of the ACLKNC bus configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBMLOCK</name>
              <description>Defines the lock protection of the AHBM bus configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB1LOCK</name>
              <description>Defines the lock protection of the AHB1 bus configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB2LOCK</name>
              <description>Defines the lock protection of the AHB2 bus configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB3LOCK</name>
              <description>Defines the lock protection of the AHB3 bus configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB4LOCK</name>
              <description>Defines the lock protection of the AHB4 bus configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB5LOCK</name>
              <description>Defines the lock protection of the AHB5 bus configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB1LOCK</name>
              <description>Defines the lock protection of the APB1 bus configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB2LOCK</name>
              <description>Defines the lock protection of the APB2 bus configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB3LOCK</name>
              <description>Defines the lock protection of the APB3 bus configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB4LOCK</name>
              <description>Defines the lock protection of the APB4 bus configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB5LOCK</name>
              <description>Defines the lock protection of the APB5 bus configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOCLOCK</name>
              <description>Defines the lock protection of the NOC bus configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR4</name>
          <displayName>PUBCFGR4</displayName>
          <description>RCC bus public configuration register4</description>
          <addressOffset>0x7CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPUB</name>
              <description>Defines the public protection of the ACLKN bus configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLKNCPUB</name>
              <description>Defines the public protection of the ACLKNC bus configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBMPUB</name>
              <description>Defines the public protection of the AHBM bus configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB1PUB</name>
              <description>Defines the public protection of the AHB1 bus configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB2PUB</name>
              <description>Defines the public protection of the AHB2 bus configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB3PUB</name>
              <description>Defines the public protection of the AHB3 bus configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB4PUB</name>
              <description>Defines the public protection of the AHB4 bus configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB5PUB</name>
              <description>Defines the public protection of the AHB5 bus configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB1PUB</name>
              <description>Defines the public protection of the APB1 bus configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB2PUB</name>
              <description>Defines the public protection of the APB2 bus configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB3PUB</name>
              <description>Defines the public protection of the APB3 bus configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB4PUB</name>
              <description>Defines the public protection of the APB4 bus configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB5PUB</name>
              <description>Defines the public protection of the APB5 bus configuration bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOCPUB</name>
              <description>Defines the public protection of the NOC bus configuration bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR5</name>
          <displayName>PUBCFGR5</displayName>
          <description>RCC bus public configuration register4</description>
          <addressOffset>0x7D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXISRAM3PUB</name>
              <description>Defines the public protection of the AXISRAM3 bus configuration bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXISRAM4PUB</name>
              <description>Defines the public protection of the AXISRAM4 bus configuration bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXISRAM5PUB</name>
              <description>Defines the public protection of the AXISRAM5 bus configuration bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXISRAM6PUB</name>
              <description>Defines the public protection of the AXISRAM6 bus configuration bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBSRAM1PUB</name>
              <description>Defines the public protection of the AHBSRAM1 bus configuration bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBSRAM2PUB</name>
              <description>Defines the public protection of the AHBSRAM2 bus configuration bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPSRAMPUB</name>
              <description>Defines the public protection of the BKPSRAM bus configuration bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXISRAM1PUB</name>
              <description>Defines the public protection of the AXISRAM1 bus configuration bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXISRAM2PUB</name>
              <description>Defines the public protection of the AXISRAM2 bus configuration bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXRAMPUB</name>
              <description>Defines the public protection of the FLEXRAM bus configuration bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPUCACHERAMPUB</name>
              <description>Defines the public protection of the NPUCACHERAM bus configuration bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VENCRAMPUB</name>
              <description>Defines the public protection of the VENCRAM bus configuration bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
