knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>PRIVCFGSR2</name>
          <displayName>PRIVCFGSR2</displayName>
          <description>RCC divider privilege configuration register2</description>
          <addressOffset>0xFA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PVS</name>
              <description>Defines the privilege protection of the IC1 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC2PVS</name>
              <description>Defines the privilege protection of the IC2 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC3PVS</name>
              <description>Defines the privilege protection of the IC3 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC4PVS</name>
              <description>Defines the privilege protection of the IC4 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC5PVS</name>
              <description>Defines the privilege protection of the IC5 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC6PVS</name>
              <description>Defines the privilege protection of the IC6 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC7PVS</name>
              <description>Defines the privilege protection of the IC7 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC8PVS</name>
              <description>Defines the privilege protection of the IC8 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC9PVS</name>
              <description>Defines the privilege protection of the IC9 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC10PVS</name>
              <description>Defines the privilege protection of the IC10 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC11PVS</name>
              <description>Defines the privilege protection of the IC11 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC12PVS</name>
              <description>Defines the privilege protection of the IC12 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC13PVS</name>
              <description>Defines the privilege protection of the IC13 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC14PVS</name>
              <description>Defines the privilege protection of the IC14 configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC15PVS</name>
              <description>Defines the privilege protection of the IC15 configuration bits (enable, ready, divider).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC16PVS</name>
              <description>Defines the privilege protection of the IC16 configuration bits (enable, ready, divider).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC17PVS</name>
              <description>Defines the privilege protection of the IC17 configuration bits (enable, ready, divider).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC18PVS</name>
              <description>Defines the privilege protection of the IC18 configuration bits (enable, ready, divider).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC19PVS</name>
              <description>Defines the privilege protection of the IC19 configuration bits (enable, ready, divider).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC20PVS</name>
              <description>Defines the privilege protection of the IC20 configuration bits (enable, ready, divider).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR2</name>
          <displayName>PUBCFGSR2</displayName>
          <description>RCC divider public configuration register2</description>
          <addressOffset>0xFAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC1PUBS</name>
              <description>Defines the public protection of the IC1 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC2PUBS</name>
              <description>Defines the public protection of the IC2 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC3PUBS</name>
              <description>Defines the public protection of the IC3 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC4PUBS</name>
              <description>Defines the public protection of the IC4 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC5PUBS</name>
              <description>Defines the public protection of the IC5 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC6PUBS</name>
              <description>Defines the public protection of the IC6 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC7PUBS</name>
              <description>Defines the public protection of the IC7 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC8PUBS</name>
              <description>Defines the public protection of the IC8 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC9PUBS</name>
              <description>Defines the public protection of the IC9 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC10PUBS</name>
              <description>Defines the public protection of the IC10 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC11PUBS</name>
              <description>Defines the public protection of the IC11 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC12PUBS</name>
              <description>Defines the public protection of the IC12 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC13PUBS</name>
              <description>Defines the public protection of the IC13 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC14PUBS</name>
              <description>Defines the public protection of the IC14 configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC15PUBS</name>
              <description>Defines the public protection of the IC15 configuration bits (enable, ready, divider).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC16PUBS</name>
              <description>Defines the public protection of the IC16 configuration bits (enable, ready, divider).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC17PUBS</name>
              <description>Defines the public protection of the IC17 configuration bits (enable, ready, divider).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC18PUBS</name>
              <description>Defines the public protection of the IC18 configuration bits (enable, ready, divider).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC19PUBS</name>
              <description>Defines the public protection of the IC19 configuration bits (enable, ready, divider).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IC20PUBS</name>
              <description>Defines the public protection of the IC20 configuration bits (enable, ready, divider).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGSR3</name>
          <displayName>SECCFGSR3</displayName>
          <description>RCC system secure configuration register3</description>
          <addressOffset>0xFB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODSECS</name>
              <description>Defines the secure protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSSECS</name>
              <description>Defines the secure protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSSECS</name>
              <description>Defines the secure protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERSECS</name>
              <description>Defines the secure protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTSECS</name>
              <description>Defines the secure protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTSECS</name>
              <description>Defines the secure protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTSECS</name>
              <description>Defines the secure protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR3</name>
          <displayName>PRIVCFGSR3</displayName>
          <description>RCC system privilege configuration register3</description>
          <addressOffset>0xFB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPVS</name>
              <description>Defines the privilege protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSPVS</name>
              <description>Defines the privilege protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSPVS</name>
              <description>Defines the privilege protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERPVS</name>
              <description>Defines the privilege protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTPVS</name>
              <description>Defines the privilege protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTPVS</name>
              <description>Defines the privilege protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTPVS</name>
              <description>Defines the privilege protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGSR3</name>
          <displayName>LOCKCFGSR3</displayName>
          <description>RCC system lock configuration register3</description>
          <addressOffset>0xFB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODLOCKS</name>
              <description>Defines the lock protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSLOCKS</name>
              <description>Defines the lock protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSLOCKS</name>
              <description>Defines the lock protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERLOCKS</name>
              <description>Defines the lock protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTLOCKS</name>
              <description>Defines the lock protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTLOCKS</name>
              <description>Defines the lock protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTLOCKS</name>
              <description>Defines the lock protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
