knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>PUBCFGSR3</name>
          <displayName>PUBCFGSR3</displayName>
          <description>RCC system public configuration register3</description>
          <addressOffset>0xFBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODPUBS</name>
              <description>Defines the public protection of the MOD configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSPUBS</name>
              <description>Defines the public protection of the SYS configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSPUBS</name>
              <description>Defines the public protection of the BUS configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERPUBS</name>
              <description>Defines the public protection of the PER configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTPUBS</name>
              <description>Defines the public protection of the INT configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTPUBS</name>
              <description>Defines the public protection of the RST configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DFTPUBS</name>
              <description>Defines the public protection of the DFT configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGSR4</name>
          <displayName>PRIVCFGSR4</displayName>
          <description>RCC privilege configuration register4</description>
          <addressOffset>0xFC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPVS</name>
              <description>Defines the privilege protection of the ACLKN configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACLKNCPVS</name>
              <description>Defines the privilege protection of the ACLKNC configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBMPVS</name>
              <description>Defines the privilege protection of the AHBM configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB1PVS</name>
              <description>Defines the privilege protection of the AHB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB2PVS</name>
              <description>Defines the privilege protection of the AHB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB3PVS</name>
              <description>Defines the privilege protection of the AHB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB4PVS</name>
              <description>Defines the privilege protection of the AHB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB5PVS</name>
              <description>Defines the privilege protection of the AHB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB1PVS</name>
              <description>Defines the privilege protection of the APB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB2PVS</name>
              <description>Defines the privilege protection of the APB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB3PVS</name>
              <description>Defines the privilege protection of the APB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB4PVS</name>
              <description>Defines the privilege protection of the APB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB5PVS</name>
              <description>Defines the privilege protection of the APB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOCPVS</name>
              <description>Defines the privilege protection of the NOC configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR4</name>
          <displayName>PUBCFGSR4</displayName>
          <description>RCC public configuration register4</description>
          <addressOffset>0xFCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPUBS</name>
              <description>Defines the public protection of the ACLKN configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACLKNCPUBS</name>
              <description>Defines the public protection of the ACLKNC configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBMPUBS</name>
              <description>Defines the public protection of the AHBM configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB1PUBS</name>
              <description>Defines the public protection of the AHB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB2PUBS</name>
              <description>Defines the public protection of the AHB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB3PUBS</name>
              <description>Defines the public protection of the AHB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB4PUBS</name>
              <description>Defines the public protection of the AHB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB5PUBS</name>
              <description>Defines the public protection of the AHB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB1PUBS</name>
              <description>Defines the public protection of the APB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB2PUBS</name>
              <description>Defines the public protection of the APB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB3PUBS</name>
              <description>Defines the public protection of the APB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB4PUBS</name>
              <description>Defines the public protection of the APB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB5PUBS</name>
              <description>Defines the public protection of the APB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOCPUBS</name>
              <description>Defines the public protection of the NOC configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR5</name>
          <displayName>PUBCFGSR5</displayName>
          <description>RCC public configuration register4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXISRAM3PUBS</name>
              <description>Defines the public protection of the AXISRAM3 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM4PUBS</name>
              <description>Defines the public protection of the AXISRAM4 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM5PUBS</name>
              <description>Defines the public protection of the AXISRAM5 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM6PUBS</name>
              <description>Defines the public protection of the AXISRAM6 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBSRAM1PUBS</name>
              <description>Defines the public protection of the AHBSRAM1 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBSRAM2PUBS</name>
              <description>Defines the public protection of the AHBSRAM2 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BKPSRAMPUBS</name>
              <description>Defines the public protection of the BKPSRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM1PUBS</name>
              <description>Defines the public protection of the AXISRAM1 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM2PUBS</name>
              <description>Defines the public protection of the AXISRAM2 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXRAMPUBS</name>
              <description>Defines the public protection of the FLEXRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NPUCACHERAMPUBS</name>
              <description>Defines the public protection of the NPUCACHERAM configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VENCRAMPUBS</name>
              <description>Defines the public protection of the VENCRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>RCC control Clear register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSIONC</name>
              <description>LSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSEONC</name>
              <description>LSE oscillator enable in Run/Sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MSIONC</name>
              <description>MSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSIONC</name>
              <description>HSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSEONC</name>
              <description>HSE oscillator enable in Run/Sleep mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL1ONC</name>
              <description>PLL1 oscillator enable in Run/Sleep mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL2ONC</name>
              <description>PLL2 oscillator enable in Run/Sleep mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL3ONC</name>
              <description>PLL3 oscillator enable in Run/Sleep mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PLL4ONC</name>
              <description>PLL4 oscillator enable in Run/Sleep mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPCCR</name>
          <displayName>STOPCCR</displayName>
          <description>RCC StopCCR configuration register</description>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSISTOPENC</name>
              <description>LSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSESTOPENC</name>
              <description>LSE oscillator enable in Run/Sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MSISTOPENC</name>
              <description>MSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSISTOPENC</name>
              <description>HSI oscillator enable in Run/Sleep mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
