knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>PRIVCFGCR4</name>
          <displayName>PRIVCFGCR4</displayName>
          <description>RCC privilege configuration register4</description>
          <addressOffset>0x17C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPVC</name>
              <description>Defines the privilege protection of the ACLKN configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACLKNCPVC</name>
              <description>Defines the privilege protection of the ACLKNC configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBMPVC</name>
              <description>Defines the privilege protection of the AHBM configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB1PVC</name>
              <description>Defines the privilege protection of the AHB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB2PVC</name>
              <description>Defines the privilege protection of the AHB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB3PVC</name>
              <description>Defines the privilege protection of the AHB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB4PVC</name>
              <description>Defines the privilege protection of the AHB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB5PVC</name>
              <description>Defines the privilege protection of the AHB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB1PVC</name>
              <description>Defines the privilege protection of the APB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB2PVC</name>
              <description>Defines the privilege protection of the APB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB3PVC</name>
              <description>Defines the privilege protection of the APB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB4PVC</name>
              <description>Defines the privilege protection of the APB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB5PVC</name>
              <description>Defines the privilege protection of the APB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOCPVC</name>
              <description>Defines the privilege protection of the NOC configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR4</name>
          <displayName>PUBCFGCR4</displayName>
          <description>RCC  public configuration register4</description>
          <addressOffset>0x17CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACLKNPUBC</name>
              <description>Defines the public protection of the ACLKN configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACLKNCPUBC</name>
              <description>Defines the public protection of the ACLKNC configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBMPUBC</name>
              <description>Defines the public protection of the AHBM configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB1PUBC</name>
              <description>Defines the public protection of the AHB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB2PUBC</name>
              <description>Defines the public protection of the AHB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB3PUBC</name>
              <description>Defines the public protection of the AHB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB4PUBC</name>
              <description>Defines the public protection of the AHB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHB5PUBC</name>
              <description>Defines the public protection of the AHB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB1PUBC</name>
              <description>Defines the public protection of the APB1 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB2PUBC</name>
              <description>Defines the public protection of the APB2 configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB3PUBC</name>
              <description>Defines the public protection of the APB3 configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB4PUBC</name>
              <description>Defines the public protection of the APB4 configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB5PUBC</name>
              <description>Defines the public protection of the APB5 configuration bits (enable, ready, divider).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NOCPUBC</name>
              <description>Defines the public protection of the NOC configuration bits (enable, ready, divider).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR5</name>
          <displayName>PUBCFGCR5</displayName>
          <description>RCC public configuration register4</description>
          <addressOffset>0x17D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXISRAM3PUBC</name>
              <description>Defines the public protection of the AXISRAM3 configuration bits (enable, ready, divider).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM4PUBC</name>
              <description>Defines the public protection of the AXISRAM4 configuration bits (enable, ready, divider).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM5PUBC</name>
              <description>Defines the public protection of the AXISRAM5 configuration bits (enable, ready, divider).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM6PUBC</name>
              <description>Defines the public protection of the AXISRAM6 configuration bits (enable, ready, divider).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBSRAM1PUBC</name>
              <description>Defines the public protection of the AHBSRAM1 configuration bits (enable, ready, divider).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AHBSRAM2PUBC</name>
              <description>Defines the public protection of the AHBSRAM2 configuration bits (enable, ready, divider).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BKPSRAMPUBC</name>
              <description>Defines the public protection of the BKPSRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM1PUBC</name>
              <description>Defines the public protection of the AXISRAM1 configuration bits (enable, ready, divider).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AXISRAM2PUBC</name>
              <description>Defines the public protection of the AXISRAM2 configuration bits (enable, ready, divider).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXRAMPUBC</name>
              <description>Defines the public protection of the FLEXRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CACHEAXIRAMPUBC</name>
              <description>Defines the public protection of the NPUCACHERAM configuration bits (enable, ready, divider).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VENCRAMPUBC</name>
              <description>Defines the public protection of the VENCRAM configuration bits (enable, ready, divider).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
