knieriem/tinygo-stm32-svd/svd/stm32n645.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART1_S</name>
      <baseAddress>0x52001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2</name>
      <baseAddress>0x40004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2_S</name>
      <baseAddress>0x50004400</baseAddress>
      <interrupt>
        <name>USART2</name>
        <description>USART2 Global interrupt</description>
        <value>160</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3</name>
      <baseAddress>0x40004800</baseAddress>
      <interrupt>
        <name>USART3</name>
        <description>USART3 Global interrupt</description>
        <value>161</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3_S</name>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART4</name>
      <baseAddress>0x40004C00</baseAddress>
      <interrupt>
        <name>UART4</name>
        <description>UART4 Global interrupt</description>
        <value>162</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART4_S</name>
      <baseAddress>0x50004C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART5</name>
      <baseAddress>0x40005000</baseAddress>
      <interrupt>
        <name>UART5</name>
        <description>UART5 Global interrupt</description>
        <value>163</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART5_S</name>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART6</name>
      <baseAddress>0x42001400</baseAddress>
      <interrupt>
        <name>USART6</name>
        <description>USART6 Global interrupt</description>
        <value>164</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART6_S</name>
      <baseAddress>0x52001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART7</name>
      <baseAddress>0x40007800</baseAddress>
      <interrupt>
        <name>UART7</name>
        <description>UART7 Global interrupt</description>
        <value>165</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART7_S</name>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART8</name>
      <baseAddress>0x40007C00</baseAddress>
      <interrupt>
        <name>UART8</name>
        <description>UART8 Global interrupt</description>
        <value>166</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART8_S</name>
      <baseAddress>0x50007C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART9</name>
      <baseAddress>0x42001800</baseAddress>
      <interrupt>
        <name>UART9</name>
        <description>UART9 Global interrupt</description>
        <value>167</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>UART9_S</name>
      <baseAddress>0x52001800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART10</name>
      <baseAddress>0x42001C00</baseAddress>
      <interrupt>
        <name>USART10</name>
        <description>USART10 Global interrupt</description>
        <value>168</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART10_S</name>
      <baseAddress>0x52001C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>VENC</name>
      <description>Video encoder</description>
      <groupName>VENC</groupName>
      <baseAddress>0x48005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VENC</name>
        <description>VENC global interrupt</description>
        <value>62</value>
      </interrupt>
      <registers>
        <register>
          <name>SWREG0</name>
          <displayName>SWREG0</displayName>
          <description>VENC ID register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x6E654000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Interrupt register (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG1</name>
          <displayName>SWREG1</displayName>
          <description>VENC interrupt register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Interrupt register (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG2</name>
          <displayName>SWREG2</displayName>
          <description>VENC bus interface configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Bus interface configuration register (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG3</name>
          <displayName>SWREG3</displayName>
          <description>VENC device configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Device configuration register (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG5</name>
          <displayName>SWREG5</displayName>
          <description>VENC base address for output stream data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for output stream data (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG6</name>
          <displayName>SWREG6</displayName>
          <description>VENC base address for output control data register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for output control data (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG7</name>
          <displayName>SWREG7</displayName>
          <description>VENC base address for reference luma register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for reference luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG8</name>
          <displayName>SWREG8</displayName>
          <description>VENC base address for reference chroma register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for reference chroma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG9</name>
          <displayName>SWREG9</displayName>
          <description>VENC base address for reconstructed luma register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for reconstructed luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG10</name>
          <displayName>SWREG10</displayName>
          <description>VENC base address for reconstructed chroma register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for reconstructed chroma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG11</name>
          <displayName>SWREG11</displayName>
          <description>VENC base address for input picture luma register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for input picture luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG12</name>
          <displayName>SWREG12</displayName>
          <description>VENC base address for input picture cb register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for input picture cb (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG13</name>
          <displayName>SWREG13</displayName>
          <description>VENC base address for input picture cr register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for input picture cr (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG14</name>
          <displayName>SWREG14</displayName>
          <description>VENC encoder control register 0</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Encoder control register 0 (such as picture information or encoding mode) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG15</name>
          <displayName>SWREG15</displayName>
          <description>VENC encoder control register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Encoder control register 1 (such as preprocessing control, crop, rotate, input format) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG16</name>
          <displayName>SWREG16</displayName>
          <description>VENC encoder control register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for second reference luma (H264 control) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG17</name>
          <displayName>SWREG17</displayName>
          <description>VENC encoder control register 3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for second reference chroma (H264 control) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG18</name>
          <displayName>SWREG18</displayName>
          <description>VENC encoder control register 4</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Encoder control register 4 (deblock filter mode, H264 control) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG19</name>
          <displayName>SWREG19</displayName>
          <description>VENC encoder control register 5</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Encoder control register 5 (input format, motion vector etc) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG20</name>
          <displayName>SWREG20</displayName>
          <description>VENC encoder control register 6</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Control of data JPEG (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG21</name>
          <displayName>SWREG21</displayName>
          <description>VENC encoder control register 7</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Control of H264 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG22</name>
          <displayName>SWREG22</displayName>
          <description>VENC stream header remainder MSB bits register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stream header remainder bits MSB (MSB aligned) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG23</name>
          <displayName>SWREG23</displayName>
          <description>VENC stream header remainder LSB bits register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stream header remainder bits LSB (MSB aligned) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG24</name>
          <displayName>SWREG24</displayName>
          <description>VENC stream buffer limit/output stream size register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stream buffer limit (64-bit addresses)/output stream size (bits) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG25</name>
          <displayName>SWREG25</displayName>
          <description>VENC encoder control register 8</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Control of MAD control and QP sum output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG26</name>
          <displayName>SWREG26</displayName>
          <description>VENC intra-slice bitmap	register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>intra-slice bitmap for probability updates (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG27</name>
          <displayName>SWREG27</displayName>
          <description>VENC encoder control register 9</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Control of H264 QP (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG28</name>
          <displayName>SWREG28</displayName>
          <description>VENC encoder control register 10</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H264 checkpoint 1-2  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
