knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>SWREG29</name>
          <displayName>SWREG29</displayName>
          <description>VENC encoder control register 11</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 Checkpoint 3 -4  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG30</name>
          <displayName>SWREG30</displayName>
          <description>VENC encoder control register 12</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 checkpoint 5 -6  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG31</name>
          <displayName>SWREG31</displayName>
          <description>VENC encoder control register 13</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 checkpoint 7 -8 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG32</name>
          <displayName>SWREG32</displayName>
          <description>VENC encoder control register 14</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 Checkpoint 8 -10 / Encoder control register 14  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG33</name>
          <displayName>SWREG33</displayName>
          <description>VENC encoder control register 15</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 Checkpoint word error 1-2 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG34</name>
          <displayName>SWREG34</displayName>
          <description>VENC encoder control register 16</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 checkpoint word error 3-4 and the second reference frame control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG35</name>
          <displayName>SWREG35</displayName>
          <description>VENC H.264 checkpoint word error 5-6/encoder control register 17</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 Checkpoint word error 5-6 / Encoder control register 17 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG36</name>
          <displayName>SWREG36</displayName>
          <description>VENC H.264 checkpoint delta QP 1-8/encoder control register 18</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>H.264 Checkpoint delta QP 1-8 / Encoder control register 18  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG37</name>
          <displayName>SWREG37</displayName>
          <description>VENC encoder control register 19, stream start offset</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Encoder control register 19  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG38</name>
          <displayName>SWREG38</displayName>
          <description>VENC macroblock count output register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Macroblock count output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG39</name>
          <displayName>SWREG39</displayName>
          <description>VENC base address for next pic luminance register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for next pic luminance (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG40</name>
          <displayName>SWREG40</displayName>
          <description>VENC stabilization mode control register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization mode control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG41</name>
          <displayName>SWREG41</displayName>
          <description>VENC stabilization motion sum div8 output register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization motion sum div8 output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG42</name>
          <displayName>SWREG42</displayName>
          <description>VENC stabilization GMV output, matrix 1, up-left position	output register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization GMV output, matrix 1 (up-left position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG43</name>
          <displayName>SWREG43</displayName>
          <description>VENC stabilization GMV output, matrix 2, up position	output register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization GMV output, matrix 2 (up position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG44</name>
          <displayName>SWREG44</displayName>
          <description>VENC stabilization matrix 3, up-right position	output register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 3 (up-right position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG45</name>
          <displayName>SWREG45</displayName>
          <description>VENC stabilization matrix 4, left position	output register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 4 (left position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG46</name>
          <displayName>SWREG46</displayName>
          <description>VENC stabilization matrix 5, GMV position	output register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 5 (GMV position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG47</name>
          <displayName>SWREG47</displayName>
          <description>VENC stabilization matrix 6, right position	output register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 6 (right position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG48</name>
          <displayName>SWREG48</displayName>
          <description>VENC stabilization matrix 7, down-left position	output register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 7 (down-left position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG49</name>
          <displayName>SWREG49</displayName>
          <description>VENC stabilization matrix 8, down position	output register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 8 (down position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG50</name>
          <displayName>SWREG50</displayName>
          <description>VENC stabilization matrix 9, down-right position	output register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Stabilization matrix 9 (down-right position) output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG51</name>
          <displayName>SWREG51</displayName>
          <description>VENC base address for cabac context tables H264	 register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for cabac context tables (H264) or probability tables  (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG52</name>
          <displayName>SWREG52</displayName>
          <description>VENC base address for MV output writing	register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for MV output writing (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG53</name>
          <displayName>SWREG53</displayName>
          <description>VENC RGB to YUV conversion coefficient A - B	register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>RGB to YUV conversion coefficient A - B (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG54</name>
          <displayName>SWREG54</displayName>
          <description>VENC RGB to YUV conversion coefficient C - E	register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>RGB to YUV conversion coefficient C - E (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG55</name>
          <displayName>SWREG55</displayName>
          <description>VENC RGB to YUV conversion coefficient F, RGB mask	MSB bit position register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>RGB to YUV conversion coefficient F, RGB mask MSB bit position (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG56</name>
          <displayName>SWREG56</displayName>
          <description>VENC intra area register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>intra area (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG57</name>
          <displayName>SWREG57</displayName>
          <description>VENC CIR intra mb position register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>CIR intra mb position (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG58</name>
          <displayName>SWREG58</displayName>
          <description>VENC intra slice bitmap for slices 0..31/base address for 	1st DCT partition register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>intra slice bitmap for slices 0..31 / Base address for 1st DCT partition (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG59</name>
          <displayName>SWREG59</displayName>
          <description>VENC intra slice bitmap for slices 32..63/base address for 	2nd DCT partition register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>intra slice bitmap for slices 32..63 / Base address for 2nd DCT partition (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG60</name>
          <displayName>SWREG60</displayName>
          <description>VENC 1st ROI area register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>1st ROI area (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG61</name>
          <displayName>SWREG61</displayName>
          <description>VENC 2nd ROI area register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>2nd ROI area (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
