knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>SWREG238</name>
          <displayName>SWREG238</displayName>
          <description>VENC MAD 3 control and output register</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>MAD 3 control and output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG256</name>
          <displayName>SWREG256</displayName>
          <description>VENC segment 1: intra 16x16 mode 0-2 penalty	register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: intra 16x16 mode 0-2 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG257</name>
          <displayName>SWREG257</displayName>
          <description>VENC segment 1: intra 16x16 mode 3, intra 4x4 0-1	penalty register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: intra 16x16 mode 3 and intra 4x4 0-1 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG258</name>
          <displayName>SWREG258</displayName>
          <description>VENC segment 1: intra 4x4 mode 2-4 penalty	register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: intra 4x4 mode 2-4 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG259</name>
          <displayName>SWREG259</displayName>
          <description>VENC segment 1: intra 4x4 mode 5-7 penalty	register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: intra 4x4 mode 5-7 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG260</name>
          <displayName>SWREG260</displayName>
          <description>VENC segment 1: intra 4x4 mode 8-9 penalty, previous	mode favor for H.264 register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: intra 4x4 mode 8-9 penalty, previous mode favor for H.264 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG261</name>
          <displayName>SWREG261</displayName>
          <description>VENC segment 1: bit cost of inter type, intra 16x16 mode	favor register</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: Bit cost of inter type, intra 16x16 mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG262</name>
          <displayName>SWREG262</displayName>
          <description>VENC segment 1: inter MB mode favor, skip mode penalty, 	penalty value for 2nd reference frame register</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: inter MB mode favor, skip mode penalty, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG263</name>
          <displayName>SWREG263</displayName>
          <description>VENC segment 1: penalty value register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG264</name>
          <displayName>SWREG264</displayName>
          <description>VENC segment 1: penalty value register</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG265</name>
          <displayName>SWREG265</displayName>
          <description>VENC segment 1: deadzone rate multiplier for plane 0-1	register</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: Deadzone rate multiplier for plane 0-1 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG266</name>
          <displayName>SWREG266</displayName>
          <description>VENC segment 1: deadzone rate multiplier for plane 2-3	register</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: Deadzone rate multiplier for plane 2-3 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG267</name>
          <displayName>SWREG267</displayName>
          <description>VENC segment 1: deadzone rate for macroblock skip token 0-1,	dmv penalty coefficient register</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 1: Deadzone rate for macroblock skip token 0-1, dmv penalty coefficient (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG268</name>
          <displayName>SWREG268</displayName>
          <description>VENC segment 2: intra 16x16 mode 0-2 penalty	register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: intra 16x16 mode 0-2 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG269</name>
          <displayName>SWREG269</displayName>
          <description>VENC segment 2: intra 16x16 mode 3 penalty, intra 4x4 mode 0-1	penalty register</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: intra 16x16 mode 3 penalty, intra 4x4 mode 0-1 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG270</name>
          <displayName>SWREG270</displayName>
          <description>VENC segment 2: intra 4x4 mode 2-4 penalty	register</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: intra 4x4 mode 2-4 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG271</name>
          <displayName>SWREG271</displayName>
          <description>VENC segment 2: intra 4x4 mode 5-7 penalty	register</description>
          <addressOffset>0x43C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: intra 4x4 mode 5-7 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG272</name>
          <displayName>SWREG272</displayName>
          <description>VENC segment 2: intra 4x4 mode 8-9 penalty, intra 4x4 previous	mode favor for H.264 register</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: intra 4x4 mode 8-9 penalty, intra 4x4 previous mode favor for H.264 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG273</name>
          <displayName>SWREG273</displayName>
          <description>VENC segment 2: bit cost of inter type, intra 16x16	mode favor register</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: Bit cost of inter type, intra 16x16 mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG274</name>
          <displayName>SWREG274</displayName>
          <description>VENC segment 2: inter MB mode favor, skip mode penalty, 	penalty value register</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: inter MB mode favor, skip mode penalty, panelty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG275</name>
          <displayName>SWREG275</displayName>
          <description>VENC segment 2: penalty value register</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG276</name>
          <displayName>SWREG276</displayName>
          <description>VENC segment 2: penalty value register</description>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG277</name>
          <displayName>SWREG277</displayName>
          <description>VENC segment 2: deadzone rate multiplier for plane 0-1	register</description>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: Deadzone rate multiplier for plane 0-1 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG278</name>
          <displayName>SWREG278</displayName>
          <description>VENC segment 2: deadzone rate multiplier for plane 2-3	register</description>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: Deadzone rate multiplier for plane 2-3 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG279</name>
          <displayName>SWREG279</displayName>
          <description>VENC segment 2: deadzone rate for macroblock skip token 0-1,	dmv penalty coefficient register</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 2: Deadzone rate for macroblock skip token 0-1, dmv penalty coefficient (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG280</name>
          <displayName>SWREG280</displayName>
          <description>VENC segment 3: intra 16x16 mode 0-2 penalty	register</description>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: intra 16x16 mode 0-2 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG281</name>
          <displayName>SWREG281</displayName>
          <description>VENC segment 3: intra 16x16 mode 3 penalty, intra 4x4 mode 0-1	penalty register</description>
          <addressOffset>0x464</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: intra 16x16 mode 3 penalty, intra 4x4 mode 0-1 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG282</name>
          <displayName>SWREG282</displayName>
          <description>VENC segment 3: intra 4x4 mode 2-4 penalty	register</description>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: intra 4x4 mode 2-4 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG283</name>
          <displayName>SWREG283</displayName>
          <description>VENC segment 3: intra 4x4 mode 5-7 penalty	register</description>
          <addressOffset>0x46C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: intra 4x4 mode 5-7 penalty (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG284</name>
          <displayName>SWREG284</displayName>
          <description>VENC segment 3: intra 4x4 mode 8-9 penalty, intra 4x4	previous mode favor for H.264 register</description>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: intra 4x4 mode 8-9 penalty, intra 4x4 previous mode favor for H.264 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG285</name>
          <displayName>SWREG285</displayName>
          <description>VENC segment 3: bit cost of inter type, intra 16x16 	mode favor register</description>
          <addressOffset>0x474</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: Bit cost of inter type, intra 16x16 mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG286</name>
          <displayName>SWREG286</displayName>
          <description>VENC segment 3: inter MB mode favor in intra/inter selection,	inter MB mode favor, penalty value for second reference frame	register</description>
          <addressOffset>0x478</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: inter MB mode favor in intra/inter selection, inter MB mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
