knieriem/tinygo-stm32-svd/svd/stm32n645.svd
        <register>
          <name>SWREG287</name>
          <displayName>SWREG287</displayName>
          <description>VENC segment 3: penalty value register</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG288</name>
          <displayName>SWREG288</displayName>
          <description>VENC segment 3: penalty value register</description>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG289</name>
          <displayName>SWREG289</displayName>
          <description>VENC segment 3: deadzone rate multiplier for plane 0-1	register</description>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: Deadzone rate multiplier for plane 0-1 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG290</name>
          <displayName>SWREG290</displayName>
          <description>VENC segment 3: deadzone rate multiplier for plane 2-3	register</description>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: Deadzone rate multiplier for plane 2-3 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG291</name>
          <displayName>SWREG291</displayName>
          <description>VENC segment 3: deadzone rate for macroblock skip token 0-1,	dmv penalty coefficient register</description>
          <addressOffset>0x48C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 3: Deadzone rate for macroblock skip token 0-1, dmv penalty coefficient (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG294</name>
          <displayName>SWREG294</displayName>
          <description>VENC Mb boost register</description>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Mb boost (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG295</name>
          <displayName>SWREG295</displayName>
          <description>VENC variance control, Pskop conding mode	register</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Variance control, Pskop conding mode (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG296</name>
          <displayName>SWREG296</displayName>
          <description>VENC synthesis configuration register encoder 1	read only register</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x06800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Synthesis configuration register encoder 1 (read only) (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG297</name>
          <displayName>SWREG297</displayName>
          <description>VENC MBRC control register</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>MBRC control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG298</name>
          <displayName>SWREG298</displayName>
          <description>VENC segment 4: intra 4x4 previous mode favor, intra 16x16	mode favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 4: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG299</name>
          <displayName>SWREG299</displayName>
          <description>VENC segment 4: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 4: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG300</name>
          <displayName>SWREG300</displayName>
          <description>VENC segment 4: penalty value register</description>
          <addressOffset>0x4B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 4: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG301</name>
          <displayName>SWREG301</displayName>
          <description>VENC segment 4: penalty value register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 4: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG302</name>
          <displayName>SWREG302</displayName>
          <description>VENC segment 5: intra 4x4 previous mode favor, intra 16x16 mode	favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 5: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG303</name>
          <displayName>SWREG303</displayName>
          <description>VENC segment 5: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 5: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG304</name>
          <displayName>SWREG304</displayName>
          <description>VENC segment 5: penalty value register</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 5: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG305</name>
          <displayName>SWREG305</displayName>
          <description>VENC segment 5: penalty value register</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 5: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG306</name>
          <displayName>SWREG306</displayName>
          <description>VENC segment 6: intra 4x4 previous mode favor, intra 16x16 mode	favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 6: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG307</name>
          <displayName>SWREG307</displayName>
          <description>VENC segment 6: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 6: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG308</name>
          <displayName>SWREG308</displayName>
          <description>VENC segment 6: penalty value register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 6: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG309</name>
          <displayName>SWREG309</displayName>
          <description>VENC segment 6: penalty value register</description>
          <addressOffset>0x4D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 6: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG310</name>
          <displayName>SWREG310</displayName>
          <description>VENC segment 7: intra 4x4 previous mode favor, intra 16x16 mode	favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 7: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG311</name>
          <displayName>SWREG311</displayName>
          <description>VENC segment 7: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 7: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG312</name>
          <displayName>SWREG312</displayName>
          <description>VENC segment 7: penalty value register</description>
          <addressOffset>0x4E0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 7: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG313</name>
          <displayName>SWREG313</displayName>
          <description>VENC segment 7: penalty value register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 7: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG314</name>
          <displayName>SWREG314</displayName>
          <description>VENC segment 8: intra 4x4 previous mode favor, intra 16x16 mode	favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4E8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 8: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG315</name>
          <displayName>SWREG315</displayName>
          <description>VENC segment 8: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 8: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG316</name>
          <displayName>SWREG316</displayName>
          <description>VENC segment 8: penalty value register</description>
          <addressOffset>0x4F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 8: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG317</name>
          <displayName>SWREG317</displayName>
          <description>VENC segment 8: penalty value register</description>
          <addressOffset>0x4F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 8: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG318</name>
          <displayName>SWREG318</displayName>
          <description>VENC segment 9: intra 4x4 previous mode favor, intra 16x16 mode	favor, penalty value for second reference frame	register</description>
          <addressOffset>0x4F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 9: intra 4x4 previous mode favor, intra 16x16 mode favor, penalty value for second reference frame (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG319</name>
          <displayName>SWREG319</displayName>
          <description>VENC segment 9: skip mode penalty, inter MB mode favor	register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 9: skip mode penalty, inter MB mode favor (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG320</name>
          <displayName>SWREG320</displayName>
          <description>VENC segment 9: penalty value register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 9: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG321</name>
          <displayName>SWREG321</displayName>
          <description>VENC segment 9: penalty value register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>segment 9: penalty value (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
